# 튜플 선언
t1 = ()
t2 = (1,)
t3 = (1, 2, 3)
t4 = 1, 2, 3
t5 = ('a', 'b', ('ab', 'cd'))

# 튜플은 요솟값을 지우거나 변경할 수 없다
t1 = (1, 2, 'a', 'b')
# del t1[0] # Error
# t1[0] = 'c' # Error

# 인덱스 접근
t1 = (1, 2, 'a', 'b')
print(t1[0]) # 1
print(t1[3]) # b
# print(t1[4]) # Error

# 슬라이싱
t1 = (1, 2, 'a', 'b')
print(t1[1:]) # (2, 'a', 'b')

# 튜플 더하기
t1 = (1, 2, 'a', 'b')
t2 = (3, 4)
t3 = t1 + t2
print(t3) # (1, 2, 'a', 'b', 3, 4)

# 튜플 곱하기
t2 = (3, 4)
t3 = t2 * 3
print(t3) # (3, 4, 3, 4, 3, 4)

# 튜플 길이 구하기
t1 = (1, 2, 'a', 'b')
print(len(t1)) # 4